package com.jc.常用数学规律;

/*
 * 常用数学规律
 * */
public class Main {

    /*
     * (1) 能被8整除,等价于后3位可以被8整除
     * (2) 能被4整除,等价于后2位可以被4整除
     * (3) 能被2(或5)整除,等价于后1位可以被2(或5)整除
     * (4) 能被3整除,等价于各位数字之和可以被3(或9)整除
     * (5) 能被11整除,等价于奇数位各位数字之和减去偶数位各位数字之和的差值可以被11整除
     * (6) 能被7/11/13整除,等价于后三位之前的数减去后三位的差值可以被7/11/13整除
     * (7) 费马定理: 2^(p-1) % p = 1
     * (8) a和b的最大公约数(a<b<=n)是 n/2
     * (9) 两个数进行约分 == 两个数都除以他们的最大公约数
     * (10) C(a,b) == C(a-1,b) + C(a-1,b-1)
     * (11) 排序不等式:
     * {
     * 两个数组a,b
     * a,b是升序 对应值相乘再相加的和最大
     * a是升序,b是降序 对应值相乘再相加的和最小
     * }
     * 异或的性质:
     * {
     * a^b = b^a
     * a^a = 0
     * }
     * */

}
